leetcode_716_max_stack.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 716. Max Stack</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 716. Max Stack</h1>
<p>
<a href="https://leetcode.com/problems/max-stack/">Problem Statement</a>
</p>

<ul class="org-ul">
<li><a href="mistake_misread_the_problem.html#ID-192401C2-DA6F-4496-B530-89A3546712FD">Mistake: Misread the problem</a></li>
<li><a href="mistake_missing_required_invariants.html#ID-3D263A82-52AE-4C90-830D-C533ABAFFF3E">Mistake: Missing required invariants</a></li>
</ul>

<p>
The source is in <a href="stack.html#ID-A0500087-56D9-4D34-936F-E8E3912C4761">Max Stack</a> since it might be useful in other problems.  It was implemented with a stack to efficiently reply to <code>pop</code> and <code>top</code>, a heap for <code>peekMax</code> and <code>popMax</code>.  While <code>top</code> is \(O(1)\), all other operations are \(O(\log n)\).
</p>
</div>
</body>
</html>